
## Plan Result (stg)




### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 8 to add, 3 to change, 1 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.voda_password[0]
  * azurerm_key_vault_secret.voda_username[0]
  * module.virtual_machine[0].azurerm_linux_virtual_machine.linvm[0]
  * module.virtual_machine[0].azurerm_network_interface.vm_nic
  * module.virtual_machine[0].module.vm-bootstrap[0].azurerm_monitor_data_collection_rule_association.linux_vm_dcra[0]
  * module.virtual_machine[0].module.vm-bootstrap[0].azurerm_virtual_machine_extension.azure_monitor[0]
  * module.virtual_machine[0].module.vm-bootstrap[0].azurerm_virtual_machine_extension.custom_script[0]
  * module.virtual_machine[0].module.vm-bootstrap[0].azurerm_virtual_machine_extension.dynatrace_oneagent[0]
* Update
  * module.finalsa_storage_account.azurerm_storage_account.storage_account
  * module.ingestsa_storage_account.azurerm_storage_account.storage_account
  * module.vodasa_storage_account.azurerm_storage_account.storage_account
* Delete
  * azurerm_key_vault_secret.vodasa_storage_account_primary_access_key


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.voda_password[0] will be created
  + resource "azurerm_key_vault_secret" "voda_password" {
      + expiration_date         = "2025-06-01T01:00:00Z"
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-hmctskv-stg"
      + name                    = "vodavm1-password"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.voda_username[0] will be created
  + resource "azurerm_key_vault_secret" "voda_username" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-hmctskv-stg"
      + name                    = "videditvm1-username"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.vodasa_storage_account_primary_access_key will be destroyed
  # (because azurerm_key_vault_secret.vodasa_storage_account_primary_access_key is not in configuration)
  - resource "azurerm_key_vault_secret" "vodasa_storage_account_primary_access_key" {
      - expiration_date         = "2025-06-01T01:00:00Z" -> null
      - id                      = "https://pre-hmctskv-stg.vault.azure.net/secrets/vodasa-storage-account-primary-access-key/12b9920e922b4f498c20a84f77727575" -> null
      - key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-hmctskv-stg" -> null
      - name                    = "vodasa-storage-account-primary-access-key" -> null
      - resource_id             = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-hmctskv-stg/secrets/vodasa-storage-account-primary-access-key/versions/12b9920e922b4f498c20a84f77727575" -> null
      - resource_versionless_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-hmctskv-stg/secrets/vodasa-storage-account-primary-access-key" -> null
      - value                   = (sensitive value) -> null
      - version                 = "12b9920e922b4f498c20a84f77727575" -> null
      - versionless_id          = "https://pre-hmctskv-stg.vault.azure.net/secrets/vodasa-storage-account-primary-access-key" -> null
        # (1 unchanged attribute hidden)
    }

  # module.finalsa_storage_account.azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                 = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Storage/storageAccounts/prefinalsastg"
        name                               = "prefinalsastg"
        tags                               = {
            "application"         = "pre-recorded-evidence"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
            "environment"         = "staging"
            "managedBy"           = "Pre Recorded Evidence"
        }
        # (96 unchanged attributes hidden)

      + network_rules {
          + bypass         = [
              + "AzureServices",
            ]
          + default_action = "Allow"
        }

        # (3 unchanged blocks hidden)
    }

  # module.ingestsa_storage_account.azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                 = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Storage/storageAccounts/preingestsastg"
        name                               = "preingestsastg"
        tags                               = {
            "application"         = "pre-recorded-evidence"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
            "environment"         = "staging"
            "managedBy"           = "Pre Recorded Evidence"
        }
        # (96 unchanged attributes hidden)

      + network_rules {
          + bypass         = [
              + "AzureServices",
            ]
          + default_action = "Allow"
        }

        # (3 unchanged blocks hidden)
    }

  # module.virtual_machine[0].azurerm_linux_virtual_machine.linvm[0] will be created
  + resource "azurerm_linux_virtual_machine" "linvm" {
      + admin_password                                         = (sensitive value)
      + admin_username                                         = (sensitive value)
      + allow_extension_operations                             = true
      + bypass_platform_safety_checks_on_user_schedule_enabled = true
      + computer_name                                          = (known after apply)
      + disable_password_authentication                        = false
      + disk_controller_type                                   = (known after apply)
      + extensions_time_budget                                 = "PT1H30M"
      + id                                                     = (known after apply)
      + location                                               = "uksouth"
      + max_bid_price                                          = -1
      + name                                                   = "voda-vm"
      + network_interface_ids                                  = (known after apply)
      + patch_assessment_mode                                  = "AutomaticByPlatform"
      + patch_mode                                             = "AutomaticByPlatform"
      + platform_fault_domain                                  = -1
      + priority                                               = "Regular"
      + private_ip_address                                     = (known after apply)
      + private_ip_addresses                                   = (known after apply)
      + provision_vm_agent                                     = true
      + public_ip_address                                      = (known after apply)
      + public_ip_addresses                                    = (known after apply)
      + resource_group_name                                    = "pre-stg"
      + size                                                   = "Standard_D2ds_v5"
      + tags                                                   = {
          + "application"         = "pre-recorded-evidence"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
          + "businessArea"        = "Cross-Cutting"
          + "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
          + "environment"         = "staging"
          + "managedBy"           = "Pre Recorded Evidence"
        }
      + virtual_machine_id                                     = (known after apply)
      + vm_agent_platform_updates_enabled                      = false
      + zone                                                   = "1"

      + boot_diagnostics {}

      + os_disk {
          + caching                   = "ReadWrite"
          + disk_size_gb              = 128
          + name                      = (known after apply)
          + storage_account_type      = "StandardSSD_LRS"
          + write_accelerator_enabled = false
        }

      + source_image_reference {
          + offer     = "0001-com-ubuntu-server-jammy"
          + publisher = "canonical"
          + sku       = "22_04-lts-gen2"
          + version   = "latest"
        }

      + termination_notification (known after apply)
    }

  # module.virtual_machine[0].azurerm_network_interface.vm_nic will be created
  + resource "azurerm_network_interface" "vm_nic" {
      + accelerated_networking_enabled = false
      + applied_dns_servers            = (known after apply)
      + id                             = (known after apply)
      + internal_domain_name_suffix    = (known after apply)
      + location                       = "uksouth"
      + mac_address                    = (known after apply)
      + name                           = "voda-vm-nic"
      + private_ip_address             = (known after apply)
      + private_ip_addresses           = (known after apply)
      + resource_group_name            = "pre-stg"
      + tags                           = {
          + "application"         = "pre-recorded-evidence"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
          + "businessArea"        = "Cross-Cutting"
          + "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
          + "environment"         = "staging"
          + "managedBy"           = "Pre Recorded Evidence"
        }
      + virtual_machine_id             = (known after apply)

      + ip_configuration {
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
          + name                                               = "voda-vm-ipconfig"
          + primary                                            = (known after apply)
          + private_ip_address                                 = (known after apply)
          + private_ip_address_allocation                      = "Static"
          + private_ip_address_version                         = "IPv4"
          + subnet_id                                          = "/subscriptions/xxxxxxxx-xxxx-xxxx-xxxx-xxxxxxxxxxxx/resourceGroups/xxxx/providers/Microsoft.Network/virtualNetworks/xxxx/subnets/xxx"
        }
    }

  # module.vodasa_storage_account.azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                 = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Storage/storageAccounts/prevodasastg"
        name                               = "prevodasastg"
        tags                               = {
            "application"         = "pre-recorded-evidence"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
            "environment"         = "staging"
            "managedBy"           = "Pre Recorded Evidence"
        }
        # (96 unchanged attributes hidden)

      + network_rules {
          + bypass         = [
              + "AzureServices",
            ]
          + default_action = "Allow"
        }

        # (3 unchanged blocks hidden)
    }

  # module.virtual_machine[0].module.vm-bootstrap[0].azurerm_monitor_data_collection_rule_association.linux_vm_dcra[0] will be created
  + resource "azurerm_monitor_data_collection_rule_association" "linux_vm_dcra" {
      + data_collection_rule_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/oms-automation/providers/Microsoft.Insights/dataCollectionRules/ama-linux-vm-logs"
      + description             = "Association between a linux VM and the appropriate data collection rule."
      + id                      = (known after apply)
      + name                    = (known after apply)
      + target_resource_id      = (known after apply)
    }

  # module.virtual_machine[0].module.vm-bootstrap[0].azurerm_virtual_machine_extension.azure_monitor[0] will be created
  + resource "azurerm_virtual_machine_extension" "azure_monitor" {
      + auto_upgrade_minor_version  = true
      + failure_suppression_enabled = false
      + id                          = (known after apply)
      + name                        = "AMALinux"
      + publisher                   = "Microsoft.Azure.Monitor"
      + tags                        = {
          + "application"         = "pre-recorded-evidence"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
          + "businessArea"        = "Cross-Cutting"
          + "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
          + "environment"         = "staging"
          + "managedBy"           = "Pre Recorded Evidence"
        }
      + type                        = "AzureMonitorLinuxAgent"
      + type_handler_version        = "1.9"
      + virtual_machine_id          = (known after apply)
    }

  # module.virtual_machine[0].module.vm-bootstrap[0].azurerm_virtual_machine_extension.custom_script[0] will be created
  + resource "azurerm_virtual_machine_extension" "custom_script" {
      + auto_upgrade_minor_version  = false
      + failure_suppression_enabled = false
      + id                          = (known after apply)
      + name                        = "HMCTSVMBootstrap"
      + protected_settings          = (sensitive value)
      + publisher                   = "Microsoft.Azure.Extensions"
      + tags                        = {
          + "application"         = "pre-recorded-evidence"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
          + "businessArea"        = "Cross-Cutting"
          + "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
          + "environment"         = "staging"
          + "managedBy"           = "Pre Recorded Evidence"
        }
      + type                        = "CustomScript"
      + type_handler_version        = "2.1"
      + virtual_machine_id          = (known after apply)
    }

  # module.virtual_machine[0].module.vm-bootstrap[0].azurerm_virtual_machine_extension.dynatrace_oneagent[0] will be created
  + resource "azurerm_virtual_machine_extension" "dynatrace_oneagent" {
      + auto_upgrade_minor_version  = true
      + failure_suppression_enabled = false
      + id                          = (known after apply)
      + name                        = "Dynatrace"
      + publisher                   = "dynatrace.ruxit"
      + settings                    = (sensitive value)
      + tags                        = {
          + "application"         = "pre-recorded-evidence"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
          + "businessArea"        = "Cross-Cutting"
          + "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
          + "environment"         = "staging"
          + "managedBy"           = "Pre Recorded Evidence"
        }
      + type                        = "oneAgentLinux"
      + type_handler_version        = "2.200"
      + virtual_machine_id          = (known after apply)
    }

Plan: 8 to add, 3 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":980,"Program":"tfcmt","SHA1":"","Target":"stg","Vars":{}} -->